In [5]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [6]:
randn(3)

array([1.22196402, 0.09264514, 0.17049708])

In [7]:
randn(3,3)

array([[ 1.45885225e-03, -1.06787594e+00, -1.52455921e+00],
       [-2.79168929e-01, -3.77136005e-01,  1.52471762e+00],
       [-9.73627729e-01,  3.03117638e-01,  1.39749554e+00]])

In [9]:
df = pd.DataFrame(data = randn(3,3),index = ["A","B","C"],columns = ["Column1","Column2","Column3"])

In [10]:
df

    Column1   Column2   Column3
A -0.405224 -0.901860 -0.817184
B  3.028926  0.989330  0.094309
C  0.472764 -0.194816  2.002376

In [12]:
print(df["Column1"])

A   -0.405224
B    3.028926
C    0.472764
Name: Column1, dtype: float64

In [13]:
print(df["Column2"])

A   -0.901860
B    0.989330
C   -0.194816
Name: Column2, dtype: float64

In [14]:
type(df["Column2"])

pandas.core.series.Series

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
df.loc["A"]

Column1   -0.405224
Column2   -0.901860
Column3   -0.817184
Name: A, dtype: float64

In [18]:
#df.loc("A")    error

In [22]:
df.loc["B"]

Column1    3.028926
Column2    0.989330
Column3    0.094309
Name: B, dtype: float64

In [23]:
df[["Column1","Column2"]]

    Column1   Column2
A -0.405224 -0.901860
B  3.028926  0.989330
C  0.472764 -0.194816

In [24]:
df

    Column1   Column2   Column3
A -0.405224 -0.901860 -0.817184
B  3.028926  0.989330  0.094309
C  0.472764 -0.194816  2.002376

In [25]:
df["Column4"] = pd.Series(randn(3),["A","B","C"])

In [26]:
df

    Column1   Column2   Column3   Column4
A -0.405224 -0.901860 -0.817184  0.595148
B  3.028926  0.989330  0.094309 -0.768224
C  0.472764 -0.194816  2.002376  1.090067

In [27]:
df["Column5"] = df["Column1"] + df["Column2"] + df["Column3"]

In [28]:
df

    Column1   Column2   Column3   Column4   Column5
A -0.405224 -0.901860 -0.817184  0.595148 -2.124268
B  3.028926  0.989330  0.094309 -0.768224  4.112565
C  0.472764 -0.194816  2.002376  1.090067  2.280324

In [29]:
df

    Column1   Column2   Column3   Column4   Column5
A -0.405224 -0.901860 -0.817184  0.595148 -2.124268
B  3.028926  0.989330  0.094309 -0.768224  4.112565
C  0.472764 -0.194816  2.002376  1.090067  2.280324

In [31]:
df.drop("Column4",axis = 1)

    Column1   Column2   Column3   Column5
A -0.405224 -0.901860 -0.817184 -2.124268
B  3.028926  0.989330  0.094309  4.112565
C  0.472764 -0.194816  2.002376  2.280324

In [32]:
df

    Column1   Column2   Column3   Column4   Column5
A -0.405224 -0.901860 -0.817184  0.595148 -2.124268
B  3.028926  0.989330  0.094309 -0.768224  4.112565
C  0.472764 -0.194816  2.002376  1.090067  2.280324

In [33]:
df.drop("Column4",axis = 1,inplace = True)

In [34]:
df

    Column1   Column2   Column3   Column5
A -0.405224 -0.901860 -0.817184 -2.124268
B  3.028926  0.989330  0.094309  4.112565
C  0.472764 -0.194816  2.002376  2.280324

In [36]:
df.loc["A","Column1"]

-0.40522374474357886

In [38]:
df.loc["B","Column5"]

4.112565026676094

In [40]:
df.loc[["A","B"],["Column1","Column5"]]

    Column1   Column5
A -0.405224 -2.124268
B  3.028926  4.112565